Revit 2026 API

# ParameterFilterElementSetCategories Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetCategories(
	ICollection<ElementId> categories
)
```
```vb
Public Sub SetCategories (
	categories As ICollection(Of ElementId)
)
```
```cpp
public:
void SetCategories(
	ICollection<ElementId^>^ categories
)
```
```fsharp
member SetCategories :
        categories : ICollection<ElementId> -> unit
```

#### Parameters

categories ICollectionElementId

#### Reference

ParameterFilterElement Class

Autodesk.Revit.DB Namespace